defmodule ControlFlow1 do
  @moduledoc """
    FizzBuzzを
    - condで実装したもの
    - caseで書いたもの
    - ガード節で書いたもの
    見比べてなにが問題をよく表現しており、メンテナンスしやすいか？
    もっとも良い実装があったら、それを進める注意喚起の方法はあるか？
  """

  @doc """
    ## cond
      手続き型言語っぽいこれ。処理が複雑ならこういう書き方もありなのかもしれないけど、
      けっきょく後々痛い目にあいそう。
      分岐が何かしら別の値とかを見るならあり
    ## case
      パターンマッチが絡んでいるので例外とか考えなくてよいのがよいと思った。
      でもまああんまりメリットを感じなかった。
      例外処理用くらいに使うのがよさそう
    ## ガード節
      問題を細かい関数に分けて考えるという意味では非常にすこすこスコティッシュ。
      関数の書く順番とか気にしないといけないのでちょっと不安。
      複雑な条件下ではcond使うかも。
      問題の切り分けができたらガード節一択だと思われ
  """
end
